app/controllers/stylists_controller.rb

SELECT "stylists".* FROM "stylists"
---
  def index
    @stylists = Stylist.all

INSERT INTO "stylists" ("first_name", "last_name", "email", "phone", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "testing"], ["last_name", "changes"], ["email", ""], ["phone", ""], ["created_at", "2021-04-28 03:30:00.309834"], ["updated_at", "2021-04-28 03:30:00.309834"], ["user_id", 2]]
---
  def create
    #@stylist = stylist.new(stylist_params)
    @stylist = current_user.stylists.build(stylist_params)

    respond_to do |format|
      if @stylist.save

UPDATE "stylists" SET "last_name" = ?, "updated_at" = ? WHERE "stylists"."id" = ?  [["last_name", "Nuei"], ["updated_at", "2021-05-02 02:58:29.336956"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @stylist.update(stylist_params)

DELETE FROM "stylists" WHERE "stylists"."id" = ?  [["id", 2]]
---
  def destroy
    @stylist.destroy

SELECT "stylists".* FROM "stylists" WHERE "stylists"."user_id" = ? AND "stylists"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]
---
  def correct_user
    @stylist = current_user.stylists.find_by(id: params[:id])

SELECT "stylists".* FROM "stylists" WHERE "stylists"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_stylist
      @stylist = Stylist.find(params[:id])